{
    "home": "Home",
    "contact us": "Contact us",
    "testimonial": "Our customers",
    "details": "Details",
    "raw material": "Raw Meterial",

    "product": {
        "products": "Products",
        "plastic welt": "Plastic Welt",
        "welting": "Welting",
        "overview": "Overview",
        "leather welt": "Leather Welt",
        "leatherboard welt": "Leatherboard Welt",
        "outsole": "Outsole",
        "stock fitting": "Stock Fitting",
        "stacked leather": "Stacked Leather",
        "desiccants": "Desiccants"},

    "about_us": {
            "about us": "About us",
            "about our company": "About Our Company",
            "about us - content": "Since 1989, our company has been a trusted supplier of leather welts and shoe-related components to major global brands. With two strategically located factories in Guangzhou, China, and Ho Chi Minh City, Vietnam, we are committed to providing exceptional service and quick turnaround times to our clients in the shoe-manufacturing industry."
        },

    "contact_us_form": {
        "name": "Name",
        "email": "Email",
        "enquiry": "Enquiry",
        "message": "Message",
        "submit": "Submit"
    },

    "plastic_welt_page": {
        "raw material content": "All our raw materials are tested and conform to the standard set by EU testing requirements, EN 71-3:2013. We stock PVC, TPR, TR, TPU, Rubber materials ready to accommodate customers' needs.",
        "pvc welt": "PVC Welt",
        "pvc welt content": "We use only environmental-friendly PVC raw material for our welt. PVC welt is lowest in price among other plastic materials.",
        "tr, tpr, tpu welt": "TR, TPR, TPU Welt",
        "tr, tpr, tpu welt content": "Our company stock a wide variety of materials to dedicate to each customer's needs.",
        "colour welt": "Multi-colour welt and Combination welt",
        "colour welt content": "Our in-house mold shop and our experience allow us to produce multi-color welt through co-extrusion. Our company is able to produce 2-color, 3-color, and/or PVC+leather welt as specified by customers."
    },

    "welting_page":{
        "leather welt content": "Classic welt made from the finest selection of leather. The premium look and feel is an essential element in the overall quality of high-end dress shoes and boots.",
        "leatherboard welt content": "Leatherboard welt is a economic alternative to leather welt. The texture and feel closely mimics that of leather counterpart."
    },

    "leather welt":{

    },

    "leatherboard_welt":{
        "production": "Production of leatherboard",
        "production content": "Extrusion is a key process in the production of leatherboard welt. Leather fibers and binders are mixed and melted in an extruder, then shaped through a die to create the desired welt shape. The extruded material is cooled, cut, and finished to meet quality standards. This efficient and customizable process yields a durable and versatile component for use in footwear manufacturing.",
        "material" : "Raw Material",
        "material content" : "Our premium bonded leather material is carefully sourced from Italy and Germany. The raw material is created by blending leather scrap with other proprietary mixtures to achieve a luxurious leather-like texture. The material is available in various thicknesses ranging from 2.0mm to 5.0mm, with increments of 0.5mm.",
        "machine": "Italian Imported Machinery",
        "machine content": "We have invested in precision machines imported directly from Italy. Similar to our leather welts, all bonded leather welts are meticulously crafted and processed using the same state-of-the-art Italian machinery, ensuring consistent quality throughout the manufacturing process.",
        "customise": "Customisation",
        "customise content": "Our experienced technicians have the capability to spray paint the welt in any desired color and finish, whether it's a solid hue, polka-dots, antiqued appearance, or even a faux-leather effect. This flexibility allows for endless customization options. In addition to the customization in color and finish, we can also tailor the welt to any design and dimensions to meet our customers' specific requirements. This makes our welts a great alternative for those seeking a premium leather-like feel at a more affordable price point."
    }

}